Repository: lperezperez/DefaultDocumentation
Catalog: Source/Properties/Resources.*.resx
Languages: ca_es, es_es

source: Parameters
ca_es: Paràmetres
es_es: Parámetros

# Description
source: Generates wiki pages for GitHub from source documentation.
ca_es: Genera les pàgines wiki per GitHub a partir de la documentació del codi font.
es_es: Genera las páginas wiki para GitHub a partir de la documentación del código fuente.

# Assembly
source: The file path of the assembly to document.
ca_es: La ruta del fitxer de muntatge a documentar.
es_es: La ruta del archivo de ensamblado a documentar.

# FileNameMode
source: The file name of the Markdowns pages.
ca_es: El format del nom d'arxiu de les pàgines Markdown generades.
es_es: El formato del nombre de archivo de las páginas Markdown generadas.

# Help
source: Shows the application help.
ca_es: Mostra l'ajuda d'aquesta aplicació.
es_es: Muestra la ayuda de esta aplicación.

# Home
source: The name of the default home page.
ca_es: El nom de la pàgina inicial predeterminada.
es_es: El nombre de la página de inicio predeterminada.

# InvalidCharReplacement
source: The char which replaces all file name invalid chars.
ca_es: El caràcter que substitueix els caràcters no permesos per a noms de fitxer.
es_es: El carácter que reemplaza todos los caracteres no válidos para nombres de archivo.

# NestedTypeVisibility
source: The visibility of the nested types.
ca_es: El tipus de visibilitat dels tipus imbricats.
es_es: El tipo de visibilidad de los tipos anidados.

# Output
source: The folder path in which documentation files will be generated.
ca_es: La ruta de la carpeta on es generaran les pàgines Markdown.
es_es: La ruta de la carpeta en la que se generarán las páginas Markdown.

# Xml
source: The file path of the XML generated documentation.
ca_es: La ruta del fitxer XML de documentació generat pel compilador.
es_es: La ruta del archivo XML de documentación generado por el compilador.

# GetHelp
source: For more information type {0} {1}
ca_es: Per obtenir més informació, escriviu {0} {1}
es_es: Para obtener más información, escriba {0} {1}

# CannotParse
source: Cannot be parsed.
ca_es: No es pot analitzar.
es_es: No se puede analizar.

# InvalidFormat
source: Has an invalid format: {0}
ca_es: Te un format incorrecte: {0}
es_es: Tiene un formato incorrecto: {0}

# NotSpecified
source: Has not been specified.
ca_es: No s'ha especificat.
es_es: No se ha especificado.

# NotFound
source: Cannot be found: {0}
ca_es: No s'ha trobat: {0}
es_es: No se ha encontrado: {0}

# CannotConvert
source: Cannot convert {0} to {1}.
ca_es: No pot convertir {0} a {1}.
es_es: No puede convertir {0} a {1}.

# CannotCreate
source: Cannot be created: {0}
ca_es: No es pot crear: {0}
es_es: No se puede crear: {0}

source: Syntax
ca_es: Sintaxi
es_es: Sintaxis

# ErrorWrittingDoc
source: Error while writing documentation for {0}
ca_es: S'ha produït un error escrivint la documentació de {0}
es_es: Se ha producido un error mientras se escribía la documentación de {0}

source: Values
ca_es: Valors
es_es: Valores

# FileNameModeMd5
source: Sets an MD5 hash (from the full name of the member) as the Markdown file name.
ca_es: Estableix un hash MD5 (a partir nom complet del membre) com a nom de la pàgina Markdown.
es_es: Establece un hash MD5 (a partir nombre completo del miembro) como nombre de la página de Markdown.

# FileNameModeName
source: Sets the type and member name without the namespace as the Markdown page name. May get collision if project has multiple types with the same name in different namespaces.
ca_es: Estableix el tipus i nom del membre sense l'espai de noms com a nom de l'arxiu Markdown. Pot col·lisionar si el projecte té diversos tipus amb el mateix nom en espais de noms diferents.
es_es: Establece el tipo y el nombre del miembro sin el espacio de nombres como el nombre del archivo Markdown. Puede producirse una colisión si el proyecto tiene varios tipos con el mismo nombre en diferentes espacios de nombres.

# FileNameModeFullName
source: Sets the full qualified name of the member as the Markdown file name.
ca_es: Estableix el nom complet del membre com a nom de l'arxiu Markdown.
es_es: Establece el nombre completo del miembro como nombre del archivo Markdown.

# NestedTypeVisibilityNamespace
source: Nested type links are showed on the namespace page.
ca_es: Els enllaços de tipus imbricats es mostren a la pàgina de l’espai de noms.
es_es: Los enlaces de tipo anidado se muestran en la página del espacio de nombres.

# NestedTypeVisibilityDeclaringType
source: Nested type links are showed on their declaring type page.
ca_es: Els enllaços de tipus imbricats es mostren a la pàgina del seu tipus declarant.
es_es: Los enlaces de tipo anidado se muestran en la página de su tipo declarante.

# NestedTypeVisibilityEverywhere
source: Nested type links are showed on both the namespace and their declaring type page.
ca_es: Els enllaços de tipus imbricats es mostren tant a l’espai de noms com a la pàgina del seu tipus declarant.
es_es: Los enlaces de tipo anidado se muestran tanto en el espacio de nombres como en la página de su tipo declarante.
